
var college ={
	"u1": {
		"enname": "Adelphi University",
		"zhname": "艾德菲大學",
		"year": "1896年",
		"type": "私立大學",
		"stuNum": "約7,859人",
		"weblink": "www.adelphi.edu",
		"survey": "艾德菲大學是紐約長島第一所高等院校。本科及碩士專業提供包括專業涉及人文、科學、人性學、商學、教育、護理和保健、社會福利、臨床心理學等課程。艾德菲大學已連續十年被《費斯克大學指南》評為性價比最高的高等院校。全美僅有24所私立院校獲此殊榮。",
		"position": "艾德菲大學著落於聞名遐邇的位於美國紐約長島最古老的高等學習機構。距離紐約市僅1小時的地鐵路程。",
		"special": [
			"2018《U.S.News》全美綜合排名#151，已連續十年被評為性價比最高的私立大學",
			"美國首先擁有心理療法研究所的綜合4年制大學已連續十年被評為性價比最高的私立大學",
			"工程學：與哥倫比亞大學合辦，分3+2和4+2兩種培養方式，畢業後獲理學雙學士學位",
			"環境研究：與哥倫比亞大學合辦，分3+2和4+2兩種培養方式，畢業後獲理學雙學士學位"
		],
		"fee": [
			"學術大一/國際大一（AAP）：$58,240 - $62,572",
			"國際大一（EAP）：$69,570 - $7 7,501",
			"MBA直錄：$14,640/學期",
			"MBA銜接（MAP 1）：$16,5 00/學期",
			"MBA銜接（MAP 2）：$24,000/學期"
		]

	},
	"u2": {
		"enname": "American University",
		"zhname": "美利堅大學",
		"year": "1893年",
		"type": "私立大學",
		"stuNum": "約13,200人",
		"weblink": "www.american.edu",
		"survey": "美利堅大學（American University），簡稱為AU起源於美國第一任總統華盛頓要求在首都建立一所美國的國家大學的倡議, 屬於愛國者聯盟盟校之一。美利堅大學有六大學院-文理學院（College of Arts & Sciences）、商學院（Kogod School of Business）、傳播學院（School of Communication）、國際服務學院 （School of International Service）、公共事務學院 （School of Public Affairs）及法學院 （Washington College of Law）。",
		"position": "位於美國首都華盛頓特區，是全美頂尖大學之一。校區距離白宮僅4英里遠，就地理之便經常有政壇上的風雲人物應邀到學校演講，如前美國總統甘迺迪，也有許多退休的政治人物在此執教。",
		"special": [
			"2018《US News》美國大學綜合排名#69",
			"2019《U.S.News》研究生商學院全美綜合排名#79",
			"2019《U.S.News》研究生法學院全美綜合排名#80",
			"因地處美國政治中心首都華盛頓，所以在政治學、公共政策、管理以及國際關係等專業上有很強的實力，其公共事業管理專業在US NEWS的排名是#5",
			"Kogod商學院獲AACSB認證，Bloomberg BusinessWeek本科商學院全美#62，US News國際商務#21，US News公共事務學院全美#12，本科國際關係TOP10",
			"實習與就業：89%本科生參加過至少一次實習，90%畢業生畢業半年內找到工作或繼續攻讀研究生",
			"海外交換：每年提供超過100個海外交換專案，學生海外交換study abroad比例高達60%（全美大學參加study abroad的平均水準僅0.9%）"
		],
		"fee": [
			"學術大一（兩學期）：58,865-72,419美元",
			"國際大一（兩學期）：61,215-74,769美元",
			"國際大一（三學期）：72,395-88,793,美元",
			"碩士橋樑（1學期）：43,810美元",
			"碩士橋樑（2學期）：58,880美元"
		]
	},
	"u3": {
		"enname": "Auburn University",
		"zhname": "奧本大學",
		"year": "1856年",
		"type": "公立大學",
		"stuNum": "約28,290人",
		"weblink": "www.auburn.edu",
		"survey": "奧本大學是阿拉巴馬州校園最大的大學，是美國南方地區的名校，擁有12個學院，在140多個領域提供學位。奧本大學甚至擁有自己的民用機場，也是全美為數不多的幾所被政府同時授予土地（land-grant）、海域（sea-grant）和太空（space-grant）用於科研工作的大學。",
		"position": "奧本大學坐落在亞拉巴馬州的奧本大學城，距美國東南部第一大城市亞特蘭大約一個半小時車程。奧本市是全美著名的大學城，被評選為 “全美十佳宜居城市”，奧本大學也被評選為“生活品質十佳大學”。奧本大學本身擁有一個240,000英尺的休閒和療養中心，其中三分之一的面積是一個室內跑道和健身房, 一個虛擬高爾夫模擬器, 一個可以容納40人的桑拿房和一個嬉水池。",
		"special": [
			"2018《U.S.News》全美綜合排名#103，公立排名#46",
			"2019《U.S.News》研究生商學院全美綜合排名#73",
			"2019《U.S.News》研究生工程學院全美綜合排名#75",
			"2019《U.S.News》研究生教育學院全美綜合排名#84",
			"2019《U.S.News》護理學院(護理碩士)全美排名#121",
			"本科工業設計全美排名#8，室內設計#9，建築設計#12，生物工程/農業工程全美排名#17，工業工程/製造工程/系統工程#25",
			"89%-95%的CPA通過率"
		],
		"fee": [
			"學術大一（IAP）：30,000美元",
			"國際大一（AAP）：31,000美元",
			"國際大一（EAP）：35,900美元",
			"碩士學術（IMAP）：15,000美元",
			"碩士銜接（MAP1）：15,700美元",
			"碩士銜接（MAP2）：23,960美元",
			"碩士銜接（MAP3）：26,900美元"
		]
	},
	"u4": {
		"enname": "Auburn University at Montgomery",
		"zhname": "蒙哥馬利奧本大學",
		"year": "1967年",
		"type": "公立大學",
		"stuNum": "约5300人",
		"weblink": "www.aum.edu",
		"survey": "蒙哥馬利奧本大學是一所公立大學, 位於美國阿拉巴馬州州府蒙哥馬利市東側，是一個充滿活力，多元化的城市，人口超過23萬。它是阿拉巴馬州的首府，擁有深厚而豐富的歷史。校區環境優雅而安靜，是一個讀書的良好場所。美國最權威的大學評估機構之一普林斯頓評論（PrincetonReview）把蒙哥馬利奧本大學列入“美國東南部最好的大學” 和 “最有價值”和“最好的商學院”。",
		"position": "",
		"special": [
			"商學院",
			"AUM的商學院全球排名前百分之十五之內，提供AACSB International所認證的本科及研究生課程。AACSB International是國際大學商學院聯盟，美國歷史最悠久並且最富盛名的商學院認證機構。",
			"通過開設各種學科，包括會計金融、經濟學、資訊系統和決策科學以及經營與管理，商學院教授學生們各種知識和技能，使他們能在專業領域更加富有競爭力。"
		],
		"fee": [
			"$19244/ per semester"
		],
		"edu": [
			"教育學院職業化的學習，將學生培育成有能力、有責任感、深思熟慮的職業教育者。學院致力於多元化學習，提供富有挑戰的教育。",
			"教育學院在本州教師執照考試中，通過率高達百分之九十以上。AUM的教師培訓項目很有名聲，在近期阿拉巴馬教育部所發行的大部分報告中，該培訓項目獲得全A。"
		]
	},
	"u5": {
		"enname": "Florida International University",
		"zhname": "佛羅里達國際大學",
		"year": "1965年",
		"type": "公立大學",
		"stuNum": "約54,000人",
		"weblink": "www.fiu.edu",
		"survey": "佛羅里達國際大學（Florida International University，簡稱FIU）建於1965年，是邁阿密第一所公立、四年制大學。學校位於美國第五大城市邁阿密，是全美25所最大公立大學之一，是佛羅里達州第二大的大學。該校面積在全美大學中排名第7，是全美十大校園之一。該校下設23個學院，涵蓋學科200餘個，95%的教師擁有博士或博士以上的學位，教學品質優異。該校屬於美國國家級大學、卡內基基金會評其為一級研究性大學，上海交大世界大學學術排名位列前500名。",
		"position": "位於美國佛羅里達州邁阿密市中心，距離南海灘、大西洋、大沼澤地國家公園和市中心僅30分鐘車程。 乘飛機到紐約只需三小時，到美國中部和南都的航程則更短。 邁阿密是全美第四大城市，擁有上千家跨國企業，也是世界各國銀行的聚集地，被《美國經濟雜誌》評選為“拉丁美洲最適合做生意的城市”。",
		"special": [
			"2019《U.S.News》護理學院(護理碩士)全美排名#66",
			"2019《U.S.News》護理學院(臨床護理博士)全美#66",
			"2019《U.S.News》研究生法學院全美綜合排名#101",
			"2019《U.S.News》研究生工程學院全美綜合排名#145",
			"2019《U.S.News》研究生教育學院全美綜合排名#158",
			"美國大學國際商務專業本科排名#5， 商學院#183，公共健康專業研究生#46",
			"會計學院是全美最大的會計學院之一",
			"擁有全球唯一水下海洋實驗室",
			"學生規模全美第五大，擁有全美第六大計算機科學專業",
			"酒店及旅遊管理學院名列全美第六，學校酒店管理專業畢業生從業於酒店及旅遊管理行業排名全美第一，全球知名酒店旅遊管理集團公司均定期來校招生",
			"國際工程實習機會-與建築巨頭Obrascón Huarte Lain(OHL)合作，體驗馬德裏總部的實習經驗",
			"商學院獲AACSB+EQUIS+AMBA認證，最具投資回報率之商學院排名#8",
			"邁阿密是國際性大都市，學生可以享受邁阿密的現代化設施以及在這個發達城市所提供的許多寶貴的實習就業就會"
		],
		"fee": [
			"國際大一（2學期）：$21,900",
			"國際大一（3學期）：$25,900"
		]
	},
	"u6": {
		"enname": "Louisiana State University",
		"zhname": "路易斯安那州立大學",
		"year": "1860年",
		"type": "公立大學",
		"stuNum": "約31,527人",
		"weblink": "www.lsu.edu",
		"survey": "路易斯安那州立大學（Louisiana State University）是路易斯安那州的旗艦大學，也是路易斯安那人最自豪和鍾愛的大學。全美最美的20 所大學之一，是美國南方地區的名校，以工程學和電腦學為王牌專業，大一完成即可申請帶薪實習，通過面試學生可以獲得暑期三個月的實習，石油專業尤佳！",
		"position": "路易斯安那州立大學位於路易斯安那州巴吞魯日市，距離新奧爾良大約2個小時車程，距離休斯頓大約4個小時車程，校園西側就是密西西比河。巴吞魯日市素以環境優美而著稱全美，LSU的校園更是一年四季美景常在。",
		"special": [
			"2018《U.S.News》全美綜合排名#133,公立大學#63",
			"2019《U.S.News》研究生商學院全美綜合排名#83",
			"2019《U.S.News》研究生法學院全美綜合排名#88",
			"2019《U.S.News》研究生工程學院全美綜合排名#97",
			"2019《U.S.News》研究生教育學院全美綜合排名#112",
			"全美排名第一的林園景觀設計課程",
			"全美唯一一所使用真實的油井提供實習培訓的高校",
			"世界上第一只轉基因克隆羊“Millie”的培育基地",
			"全球最頂尖的內部審計課程",
			"工程學院畢業起薪8萬多美金"
		],
		"fee": [
			"學術大一（2學期）：$43,300-44,150",
			"國際大一（2學期）：$42,500-44,950",
			"國際大一（3學期）：$51,900-53,950"
		]
	},
	"u7": {
		"enname": "University of Central Florida",
		"zhname": "中佛羅里達大學",
		"year": "1963年",
		"type": "公立大學",
		"stuNum": "約63,016人",
		"weblink": "www.ucf.edu",
		"survey": "中佛羅里達大學（通常簡稱UCF），佛羅里達州立大學的成員之一，1963年為了給位於學校東部5 6公里的甘迺迪航太中心提供高素質的航太技術培訓而以佛羅里達工程大學名字建校。是佛羅里達最大的本科教育公立大學，還是排名第二的全美最大的大學、全美三大光學中心之一。",
		"position": "大學的所在地奧蘭多是美國南部觀光勝地，除了一年四季的氣候非常的適宜外 ，其眾多的主題樂園區每年吸引美國本土及世界各地數以百萬的遊客到此朝聖。其著名的主題樂園區包括迪士尼樂園，海洋世界，米高梅及環球影城及甘迺迪航空中心等大型遊樂設施。學校距離機場約半小時車程。",
		"special": [
			"2018《U.S.News》全美綜合排名#171，公立大學#90",
			"2019《U.S.News》研究生工程學院全美綜合排名#75",
			"2019《U.S.News》研究生醫學院(醫學研究)全美#86",
			"2019《U.S.News》研究生教育學院全美綜合排名#89",
			"2019《U.S.News》護理學院(護理碩士)全美排名#87",
			"2019《U.S.News》護理學院(臨床護理博士)全美#101",
			"“最具創造力大學”排名#13",
			"工業/製造/系統工程排名#45，電腦工程#58",
			"最佳本科工程課程排名#98",
			"與波音公司、迪士尼、洛克希德·馬丁公司、西門子等各業界領軍企業保持著良好的夥伴關係",
			"針對納米科學、太陽能、法證科學和模擬培訓等領域的專門研究中心"
		],
		"fee": [
			"本科直錄課程：$27,958",
			"2學期國際大一：$22,500",
			"3學期國際大一：$24,900"
		]
	},
	"u8": {
		"enname": "University of Dayton",
		"zhname": "戴頓大學",
		"year": "1850年",
		"type": "私立大學",
		"stuNum": "約10,549人",
		"weblink": "www.udayton.edu",
		"survey": "戴頓大學，又譯代頓大學，是全美十大天主教大學之一， 同時也是俄亥俄州最大的私立學校。學校本科生新生保有率達到90.8%，為該州學生滿意度最高的大學，並位列全美大學學生滿意度前十名。戴頓大學的強勢學院包括工程學院、商學院、法學院等，其中以航空航太工程、企業管理等專業為最佳，在美國享有很高的學術聲譽。",
		"position": "戴頓大學位於美國中西部技術和工業中心俄亥俄州的Dayton市東南方約2英哩的郊區。Dayton市是著名的Wright-Patterson Ai r Force Bas e、Mead等大企業公司所在地，也是航空工業的出生地，更是世界最大的科學技術人才集中地之一。",
		"special": [
			"2018《U.S.News》全美綜合排名#124",
			"2019《U.S.News》研究生工程學院全美#54",
			"2019《U.S.News》研究生教育學院全美#124",
			"2019《U.S.News》研究生法學院全美綜合排名#17",
			"工程學院全美排名#65，同學們有機會參與具有開創性的研究專案",
			"商學院的創業學專案入圍全美20強，參與創業學專案的同學們常常參與各種全國競賽，並取得優異成績",
			"法學院是“卡內基教學促進基金會”評選出的優秀法律教學法學院代表10所中的一所教育學院全美排名#107"
		],
		"fee": [
			"本科：$ 49,070",
			"研究生：$ 923 /學時"
		]
	},
	"u9": {
		"enname": "University of Illinois at Chicago",
		"zhname": "伊利諾伊大學(芝加哥分校)",
		"year": "1965年",
		"type": "公立大學",
		"stuNum": "約29,048人",
		"weblink": "www.uic.edu",
		"survey": "伊利諾伊大學芝加哥分校（Univers ity of Ill inois at Chi cago），簡稱UIC，為世界最具影響力的公立大學系統之一——伊利諾伊大學的重要成員，是芝加哥地區規模最大的公立研究型大學。在大芝加哥地區，UIC和西北大學、芝加哥大學並稱為該區域內最好的三所大學。",
		"position": "伊利諾伊大學芝加哥分校擁有東西兩個校區，皆位於美國第二大商業中心芝加哥市的心臟地帶，地理位置優勢顯著，位於東校區的Liautaud商學院在美國排名前100，依託芝加哥的金融中心優勢，與各個行業的結合交流十分緊密，學生有很多與世界尖端行業企業交流實習工作的機會；位於西校區的醫學院更是在業內頗具影響力，口腔醫學院、臨床醫學院、公共衛生學院、藥學院、護理學院等都在全美屬於頂尖水準，為伊利諾伊培養了很多的醫學專業人士，也承擔了美國甚至世界範圍內醫學健康領域多個大型專案與工程。",
		"special": [
			"2018《U.S.News》全美綜合排名#145，公立大學#73",
			"2019《U.S.News》護理學院(臨床護理博士)全美#12",
			"2019《U.S.News》護理學院(護理碩士)全美#18",
			"2019《U.S.News》研究生教育學院全美綜合排名#54",
			"2019《U.S.News》研究生工程學院全美綜合排名#65",
			"在《財經雜誌》評選的25所最具價值院校中榮列#17",
			"被USNEWS命名為美國最多元化校園之一",
			"設計課程被《商業內參》評選為“世界25所最佳設計院校之一”",
			"與六大洲200+校區均有交換協議"
		],
		"fee": [
			"學術大一（IAP）：$29,500",
			"國際大一（AAP）：$31,000",
			"國際大一（EAP）：$38,000"
		]
	},
	"u10": {
		"enname": "University of Kansas",
		"zhname": "堪薩斯大學",
		"year": "1865年",
		"type": "公立大學",
		"stuNum": "約28,091人",
		"weblink": "www.ku.edu",
		"survey": "堪薩斯大學（Uni versity of K ansas），簡稱KU，具有超過150年的建校史，現已成為美國著名的公立研究型大學之一。堪薩斯大學是美國大學協會（AAU）的成員校之一，該協會由美國及加拿大受到廣泛認可的62所名校組成。堪薩斯大學走出的知名校友遍佈社會各界，包括福特汽車公司的總裁艾倫·穆拉利，籃球運動的發明者詹姆斯·奈史密斯，著名NBA巨星張伯倫等等。",
		"position": "堪薩斯大學位於堪薩斯州勞倫斯市的市中心附近，保有美國中部純民風的特色，尤其在犯罪率上，比美國的各大都市比起都低的很多。勞倫斯的物價與東西海岸大城相比也偏低，減輕了不少海外學生的生活開銷負擔。距堪薩斯市約40英里、距堪薩斯州首都托皮卡約30英里。",
		"special": [
			"2018《U.S.News》全美綜合排名#115，公立大學#53",
			"2019《U.S.News》研究生學院排名：教育學院#17、商學院#73、法學院#74、工程學院#95、護理碩士和臨床護理博士為#50和#48、醫學研究和基層護理的醫學院分別為#66和#56",
			"城市管理與政策全美#1，石油工程全美排名#12",
			"環境政策與管理全美#6，臨床心理學、財政和預算專業全美#16，藥學全美#21，臨床心理學全美#31",
			"教育學院全美#15，公共事務管理學院全美#19，法學院全美#65，藝術學院全美#69，工程學院全美#98"
		],
		"fee": []
	},

	"u11": {
		"enname": "University of South Carolina",
		"zhname": "南卡羅來納大學",
		"year": "1801年",
		"type": "公立大學",
		"stuNum": "約49,220人",
		"weblink": "www.sc.edu",
		"survey": "南卡羅來納大學（Uni versity of South Carol ina），簡稱SC，具有超過 200 年的歷史，是一所美國著名的公立研究型大學，美國歷史最悠久的公立大學之一，受到南方院校聯盟委員會的認可。南卡羅來納大學共擁有12所學院，提供超過350門學位課程，包括本科、碩士、博士以及職業學位。除了以合理的價格提供優良的教育之外，南卡羅來納大學還以其對學生的承諾、美麗而歷史悠久的校園，以及傑出的設施而聞名。",
		"position": "南卡羅來納大學位於南卡羅來納州的中心——哥倫比亞市，有著小城鎮的友好與大都市特有的吸引力，是一座友善且安全的城市，也非常適合學生。附近壯觀的阿帕拉契山脈和平和的大西洋沿岸沙灘，都只有2個小時的距離。",
		"special": [
			"2018《U.S.News》全美綜合排名#103，公立大學#46",
			"2019《U.S.News》研究生商學院全美綜合排名#65",
			"2019《U.S.News》研究生教育學院全美綜合排名#84",
			"2019《U.S.News》研究生法學院全美綜合排名#88",
			"2019《U.S.News》研究生工程學院全美綜合排名#97",
			"2019《U.S.News》護理學院(護理碩士)全美排名#39",
			"2019《U.S.News》護理學院(臨床護理博士)全美#44",
			"全美排名第一的本科國際商務專業",
			"最頂尖的風險管理和保險課程以及供應鏈管理",
			"美國規模最大的體育和娛樂管理專業",
			"護理學院全美排#52",
			"法學院全美排名#88",
			"教育學院全美排名#93",
			"工程學院全美排名#104"
		],
		"fee": [
			"學術大一（IAP）：$43,535-49,430",
			"國際大一（AAP）：$43,935-49,830",
			"國際大一（EAP）：$54,370-58,330"
		]
	},
	"u12": {
		"enname": "University of the Pacific",
		"zhname": "太平洋大學",
		"year": "1851年",
		"type": "私立大學",
		"stuNum": "約6,128人",
		"weblink": "www.pacific.edu",
		"survey": "太平洋大學（Uni versity of the Pacifi c）是一所位於美國加利福尼亞州斯托克頓的著名私立大學，學校成立於1851年，隸屬循道會，被《美國新聞與世界報導》評為一級國家級大學。太平洋大學下設7所學院，有80多種本科專業，最受歡迎的5個專業分別是商務、工科、生物科學、藥學預科和牙醫預科。學校教師擁有高質量的教學水準，高度互動的師生關係和廣泛的課外活動培養了學生的能力，也是太平洋大學的優勢特徵。",
		"position": "太平洋大學坐落在加州斯托克頓市，校園風景如畫，該市位於加州三角洲航道，因此有很多水上運動專案，包括噴氣滑雪、衝浪和帆船。斯托克頓市位於加州北部，緊鄰太浩湖、約塞米蒂國家公園和太平洋海岸。學校到三藩市市僅需45分鐘，到聖何塞市和納帕山谷僅需90分鐘。",
		"special": [
			"2018《U.S.News》全美綜合排名#110",
			"被《福布斯》評為頂尖大學",
			"被《普林斯頓評論》評為最佳西部大學",
			"本科工程專業排名#58",
			"畢業生薪酬加州排名#8"
		],
		"fee": [
			"學術大一（IAP）：$55,501-63,681",
			"國際大一（AAP）：$57,351-65,531",
			"國際大一（EAP）：$66,011-71,311"
		]
	},
	"u13": {
		"enname": "San Francisco State University",
		"zhname": "舊金山州立大學",
		"year": "1899年",
		"type": "公立大學",
		"stuNum": "30469人",
		"beforename":[
			"舊金山州立學院（San Francisco State Normal School） (1899–1921)",
			"舊金山州立師範學院（San Francisco State Teachers College） (1921–35)",
			"舊金山州立大學（San Francisco State College） (1935–74)"
		],
		"weblink": "www.sfsu.edu",
		"survey": "舊金山州立大學（San Francisco State University）位於舊金山西南方，是北加州與舊金山灣區的核心都市，交通十分便利，是二十三個加州州立大學之一，在美國西部名列前五十位。",
		"position": "美國加州舊金山1600霍洛威大道（1600 Holloway Avenue）",
		"special": [
			"舊金山州立大學排名美國西部大學中的第四十五位。",
			"2000年，舊金山州立大學被譽為「Western University peers」之一。",
			"舊金山州立大學占了美國8%的交換生。",
			"舊金山州立大學的物理醫學治療碩士課程是全美前二十名之一。",
			"舊金山州立大學的生物科學本科生占全美1%。",
			"舊金山州立大學在哲學碩士方面是世界級。"
		],
		"fee": [
			"大學部：$16,762/年",
			"研究所：$15,028 /年",
			"MBA/MSBA $21,748 /年"
		]
	},
	"u14": {
		"enname": "Berkeley College",
		"zhname": "伯克利學院",
		"year": "1931年",
		"type": "私立大學",
		"stuNum": "7000",
		"weblink": "berkeleycollege.edu",
		"survey": "伯克利學院（Berkeley College）是一所位於紐約曼哈頓中心，專攻商科的私立大學，因其地理位置和企業資源在紐約地區聞名。學校建校於1931年，在紐約及新澤西擁有7個分校。全校7000餘名學生，國際生近700，來自全球近80個國家及地區。留學生主要來自德國及北歐，中國學生佔全部國際學生的10%左右。熱門專業Fashion Merchandising and Management（時尚營銷管理）因歷年來學校師資及人脈優勢，為畢業生創造極佳就業平台而最受歡迎。",
		"position": "",
		"special": [
			"學校位於紐約曼哈頓中心第五大道，上課窗外即是帝國大廈，下課下樓曼哈頓即是校園。",
			"專注商科，所有教授有實戰經驗，並透過豐富人脈關係讓學生參與企業實際操作課題，為學生就業打基礎。",
			"熱門專業課程“時尚營銷管理”由全球大牌現任設計師及營銷精英教授授課，帶領學生參與“紐約時裝週”等業內盛事。",
			"每位學生保障實習機會。",
			"2013全美“畢業生起薪比學費比值”排名全美前4%，高於眾多名校；近10年就業率高於90%（包括金融危機期間），近3年在95%左右，適於計劃畢業留美的學生。"
		],
		"fee": [
			"本科 23600美金/年",
			"MBA 14850美金/年"
		]
	},
	"u15": {
		"enname": "Sacred Heart University",
		"zhname": "聖心大學",
		"year": "1963",
		"type": "私立大學",
		"stuNum": "",
		"daxuenum":"4,232",
		"yannum":"2,784",
		"weblink": "www.sacredheart.edu",
		"survey": "聖心大學（Sacred Heart University）是位於美國康乃狄克州費爾菲爾德的一所羅馬天主教大學，在全美國北部大學中排名第44。",
		"position": "",
		"special": [
			"2015年美國新聞和世界報導將聖心大學評為美國北部最出色的大學，新英格蘭地區頂尖文科院校。",
			"聖心大學位於美國康涅狄格州費爾菲爾德市，距紐約一個小時車程。周邊地區是美國“財富500強”企業第三大聚集地，幫助學校為學生提供實習機會。",
			"2017年，聖心大學與位於紐約的哥倫比亞大學和倫斯勒理工學院合作開設了3+2課程。該課程計劃為在聖心大學完成3年的數學，化學或電腦科學等理科學科的學生，提供到哥倫比亞大學或倫斯勒理工學院繼續完成剩餘2年學業的機會。"
		],
		"fee": [
			"$20,575 /per semester"
		]
	}
}
function getUrlArgObject(){    
    var args=new Object();    
    var query=location.search.substring(1);//获取查询串    
    var pairs=query.split("&");//在逗号处断开    
    for(var i=0;i<pairs.length;i++){    
        var pos=pairs[i].indexOf('=');//查找name=value    
        if(pos==-1){//如果没有找到就跳过    
            continue;    
        }    
        var argname=pairs[i].substring(0,pos);//提取name    
        var value=pairs[i].substring(pos+1);//提取value   
        // console.log(decodeURI(value)) 
        args[argname]=decodeURI(value);//存为属性    
    }    
    return args;//返回对象    
}
var urlwen = getUrlArgObject();

$(function(){
	$(".infomenu").on('click',function(){
		$(".menu-right").slideToggle();
		$(".menu-left").slideUp()
	})
	$(".loginmenu").on('click',function(){
		$(".menu-left").slideToggle();
		$(".menu-right").slideUp()
	})
	console.log(urlwen.name)
	
	var dataobj = college[urlwen.name]
	if(urlwen.name){
		if(dataobj.zhname!=""){
			// 特色优势
			var tesearr = dataobj.special;
			//预估费用
			var feearr = dataobj.fee
			var tesestr = "";
			var feestr = ""
			for (var i = 0; i < tesearr.length; i++) {
				
				tesestr+='<li><span class="fa fa-square"></span><p>'+tesearr[i]+'</p></li>'
			}
			var showfee = "none";
			if(feearr.length>0){
				showfee = "block";
				for (var i = 0; i < feearr.length; i++) {
					
					feestr+='<li>'+feearr[i]+'</li>'
				}
			}
			
			var result = "";
			// 地理位置
			var showposition = "block";
			if(dataobj.position==""){
				showposition = "none";
			}else{
				showposition = "block";
			}
			var showedu = "none";
			if(dataobj.edu){
				showedu = "block";
				var eduarr = dataobj.edu;
				var edustr = ""
				for (var i = 0; i < eduarr.length; i++) {
					edustr+='<li>'+eduarr[i]+'</li>'
				}
			}

			// 学生人数是否存在
			var showstu = "none";
			var show
			if(dataobj.stuNum!=""){
				showstu = "block";
			}
			var showdaxue = "none";
			if(dataobj.yannum){
				showdaxue = "block";
			}

			// 原校名
			var bestr = "";
			var showbeforename = "none"
			if(dataobj.beforename){
				showbeforename = "block";
				var bearr = dataobj.beforename;
				for (var i = 0; i < bearr.length; i++) {
					bestr += '<p>'+bearr[i]+'</p>'
				}
			}

			result +='<div class="base"><div class="title"><p>'+dataobj.enname+'</p><h3>'+dataobj.zhname+'</h3></div>'
			+'<div class="info"><p>創校年份：'+dataobj.year+'</p><p>學校類型：'+dataobj.type+'</p><p style="display: '+showstu+'">學生人數：'+dataobj.stuNum+'</p>'
			+'<p style="display: '+showdaxue+'">大學部人數：'+dataobj.daxuenum+'</p><p style="display: '+showdaxue+'">研究生人數：'+dataobj.yannum+'</p>'
			+'<p style="display: '+showbeforename+'">原校名：</p>' + bestr
			+'<p>學校官網：<a target="_blank" href="https://'+dataobj.weblink+'">'+dataobj.weblink+'</a></p></div></div>'
			+'<div class="survey con"><h5>學校概況：</h5><p>'+dataobj.survey+'</p></div><div class="about">'
			+'<div class="atitle"><span class="line left"></span><span class="txt">ABOUT</span><span class="line right"></span></div>'
			+'<div class="con" style="display: '+showposition+'"><h5>地理位置：</h5><p>'+dataobj.position+'</p></div>'
			+'<div class="con" style="display: '+showedu+'"><h5>教育学院：</h5><ul>'+edustr+'</ul></div>'
			+'<div class="con"><h5>特色優勢：</h5><ul>'+tesestr+'</ul></div>'
			+'<div class="con" style="display: '+showfee+'"><h5>預估費用：</h5><ul>'+feestr+'</ul></div><div class="con"><h5>申請要求：請來臨展會現場諮詢大學代表</h5></div></div>'


			$(".main").html(result);
		}else{
			alert("該大學暫無簡介！")
			window.location.href="USNEWSFAIR2018.html"
		}
	}else{
		window.location.href="USNEWSFAIR2018.html"
	}
	
	

})

/* 
特色优势
<ul><li><span class="fa fa-square"></span><p></p></li></ul>
预估费用
<li>學術大一/國際大一（AAP）：$58,240 - $62,572</li>

 */